Revit 2027 API
FabricationRodInfo.IsAttachedToStructure Property
 Checks if the hanger is attached to structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAttachedToStructure { get; }
Public ReadOnly Property IsAttachedToStructure As Boolean
	Get
public:
property bool IsAttachedToStructure {
	bool get ();
}
member IsAttachedToStructure : bool with get
Property Value
Boolean
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace